{"title":"About","site_url":"https://jackman3005.github.io","base_url":"","rel_path":"/about/","full_url":"https://jackman3005.github.io/about/","full_path":"https://jackman3005.github.io/about/About.json","body":"**Hello folks! Welcome to `code crazy`**\n\n# Background\nMy name is Jack Coy. I grew up in a small farm town in Michigan about an hour away from Detroit.\nAfter high school I studied Computer Science at Eastern Michigan University. During my time at EMU, \nI started my professional career at a software consultancy called [Menlo Innovations](http://menloinnovations.com/).\nNot initially understanding what I was getting myself into, I quickly found out that Menlo \nis a passionate advocate of [Extreme Programming](https://www.agilealliance.org/glossary/xp/).\nFor those who have forgotten, Extreme Programming (XP) is a flavor of agile software development that is \nmost known for its short (1 week) iterations, [Pair Programming](http://www.extremeprogramming.org/rules/pair.html), \nand [Test Driven Development](http://agiledata.org/essays/tdd.html).\nTill this day, I am certain there was no faster way for me to get ramped up into professional software\ndevelopment than pairing 8 hours a day with someone who actually knew what they were doing. The\nlearning intensity was truly invigorating! After two and half years at Menlo Innovations I had completed my\nundergraduate degree at EMU.\n\nAt the time, I felt that school ended abruptly for me and I was seeking more. I enrolled in the\nComputer Science Masters program at the University of Colorado - Boulder. My experience at UC\nwas fantastic. I was able to get a position as a Teachers Assistant where I taught undergraduate\ncomputer science classes. This helped me realize my hidden passion for teaching. I met some great people\nand took some excellent classes. Most notably:\n\n- Machine Learning\n- Deep Neural Networks\n- Natural Language Processing\n- Ethical Hacking (all-time favorite class)\n\nAt the end of my first year in the masters program I got a job at [Pivotal Labs](https://pivotal.io/labs).\nOriginally planning to stay only for the summer break, I ended up getting thoroughly distracted by life \nin the professional scene. My intentions of completing a masters degree eluded me...\n\nAfter two and a half years at Pivotal in Boulder, I relocated to the [Pivotal office in Sydney](https://pivotal.io/locations/sydney) \nin September of 2017. \n\n# Intentions\n\nOver the years I have had a number of experiences that I thought the rest of the world\nmay be interested in. I've mostly been too lazy to share these, but I've started to realize\nthat some of my experiences are close to unique and there are people that\nwould love to hear what I have to contribute.\n\nIn addition to wanting to contribute back to the community, I'd also like to improve\nmy writing skills and work towards making blogging something that is easy and stress free.\n\n\n# Feedback\nI've grown to learn that feedback can be one of the greatest gifts to receive. \nIf you have anything you'd like me to consider, please reach out to me on one my social\nmedia accounts! Seriously, I encourage you to have a low threshold for what you consider\nimportant to mention.\n\nHope you enjoy your stay, feel free to poke around!\n\nCheers, mate!\n\n<img src=\"/static/img/photo_of_jack.jpg\" alt=\"photo of Jack\" width=\"500px\"/>\n\n\n<a href=\"https://github.com/Jackman3005\"><span class=\"icon icon--github\"><svg viewBox=\"0 0 16 16\"><path fill=\"#828282\" d=\"M7.999,0.431c-4.285,0-7.76,3.474-7.76,7.761 c0,3.428,2.223,6.337,5.307,7.363c0.388,0.071,0.53-0.168,0.53-0.374c0-0.184-0.007-0.672-0.01-1.32 c-2.159,0.469-2.614-1.04-2.614-1.04c-0.353-0.896-0.862-1.135-0.862-1.135c-0.705-0.481,0.053-0.472,0.053-0.472 c0.779,0.055,1.189,0.8,1.189,0.8c0.692,1.186,1.816,0.843,2.258,0.645c0.071-0.502,0.271-0.843,0.493-1.037 C4.86,11.425,3.049,10.76,3.049,7.786c0-0.847,0.302-1.54,0.799-2.082C3.768,5.507,3.501,4.718,3.924,3.65 c0,0,0.652-0.209,2.134,0.796C6.677,4.273,7.34,4.187,8,4.184c0.659,0.003,1.323,0.089,1.943,0.261 c1.482-1.004,2.132-0.796,2.132-0.796c0.423,1.068,0.157,1.857,0.077,2.054c0.497,0.542,0.798,1.235,0.798,2.082 c0,2.981-1.814,3.637-3.543,3.829c0.279,0.24,0.527,0.713,0.527,1.437c0,1.037-0.01,1.874-0.01,2.129 c0,0.208,0.14,0.449,0.534,0.373c3.081-1.028,5.302-3.935,5.302-7.362C15.76,3.906,12.285,0.431,7.999,0.431z\"/></svg>\n</span><span class=\"username\">Jackman3005</span></a>\n\n","meta":{"layout":"default","title":"About","permalink":"about/","render":"dynamic"}}